---
kind: type
id: T:Autodesk.Revit.Exceptions.CentralModelVersionArchivedException
source: html/9b54c5a2-22f3-ac30-3efd-7ef80adff6ea.htm
---
# Autodesk.Revit.Exceptions.CentralModelVersionArchivedException

Exception is thrown when last central version merged into the local model has been archived in the central model.
Reload Latest or Synchronized with Central needs to be conducted before the current failed operation is retried.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CentralModelVersionArchivedException : CentralModelException
```